note/drawio/converted/dot/260415-btn-debounce.dot
digraph G {
  graph [rankdir=LR];
  node [shape=box, style="rounded,filled", fillcolor="#f8f9fb", color="#5b6b7a", fontname="Arial"];
  "n_JfB_RceYVCo8XynwxTDX_16" [label="STOP\nrun_stop=0clear=0"];
  "n_JfB_RceYVCo8XynwxTDX_18" [label="node_TDX-18"];
  "n_JfB_RceYVCo8XynwxTDX_23" [label="CLEARclear=1"];
  "n_JfB_RceYVCo8XynwxTDX_34" [label="RUN\nrun_stop=1"];
  "n_JfB_RceYVCo8XynwxTDX_36" [label="MODE\nmode=~mode"];
  "n_JfB_RceYVCo8XynwxTDX_37" [label="STARTrun_stop=0mode=0clear=0"];
  "n_JfB_RceYVCo8XynwxTDX_67" [label="Btn_L==1"];
  "n_JfB_RceYVCo8XynwxTDX_68" [label="Next Clock"];
  "n_JfB_RceYVCo8XynwxTDX_69" [label="Btn_R==1"];
  "n_JfB_RceYVCo8XynwxTDX_70" [label="Btn_R==1"];
  "n_JfB_RceYVCo8XynwxTDX_71" [label="Next Clock"];
  "n_JfB_RceYVCo8XynwxTDX_72" [label="Btn_D==1"];
  "n_JfB_RceYVCo8XynwxTDX_73" [label="push==1pop==0"];
  "n_KXh9xaAsaYVUpem71158_1" [label="counter_10000"];
  "n_KXh9xaAsaYVUpem71158_11" [label="node_158-11"];
  "n_KXh9xaAsaYVUpem71158_12" [label="control_unit"];
  "n_KXh9xaAsaYVUpem71158_13" [label="run_en"];
  "n_KXh9xaAsaYVUpem71158_14" [label="clear_en"];
  "n_KXh9xaAsaYVUpem71158_15" [label="down_mode"];
  "n_KXh9xaAsaYVUpem71158_16" [label="datapath"];
  "n_KXh9xaAsaYVUpem71158_17" [label="tick_gen"];
  "n_KXh9xaAsaYVUpem71158_18" [label="clk"];
  "n_KXh9xaAsaYVUpem71158_19" [label="rst"];
  "n_KXh9xaAsaYVUpem71158_2" [label="node_1158-2"];
  "n_KXh9xaAsaYVUpem71158_20" [label="run_en"];
  "n_KXh9xaAsaYVUpem71158_21" [label="tick"];
  "n_KXh9xaAsaYVUpem71158_22" [label="node_158-22"];
  "n_KXh9xaAsaYVUpem71158_23" [label="tick_counter"];
  "n_KXh9xaAsaYVUpem71158_24" [label="clk"];
  "n_KXh9xaAsaYVUpem71158_25" [label="rst"];
  "n_KXh9xaAsaYVUpem71158_26" [label="tick"];
  "n_KXh9xaAsaYVUpem71158_27" [label="run_en"];
  "n_KXh9xaAsaYVUpem71158_28" [label="clear_en"];
  "n_KXh9xaAsaYVUpem71158_29" [label="down_mode"];
  "n_KXh9xaAsaYVUpem71158_32" [label="fnd_controller"];
  "n_KXh9xaAsaYVUpem71158_33" [label="fnd_com[3:0]"];
  "n_KXh9xaAsaYVUpem71158_34" [label="fnd_data[7:0]"];
  "n_KXh9xaAsaYVUpem71158_35" [label="datapath"];
  "n_KXh9xaAsaYVUpem71158_36" [label="clk_tick_gen"];
  "n_KXh9xaAsaYVUpem71158_38" [label="tick_counter"];
  "n_KXh9xaAsaYVUpem71158_4" [label="node_1158-4"];
  "n_KXh9xaAsaYVUpem71158_40" [label="digit_splitter"];
  "n_KXh9xaAsaYVUpem71158_41" [label="clk_div_1khz"];
  "n_KXh9xaAsaYVUpem71158_44" [label="digit_sel[1:0]"];
  "n_KXh9xaAsaYVUpem71158_45" [label="counter_4"];
  "n_KXh9xaAsaYVUpem71158_47" [label="mux_4x1"];
  "n_KXh9xaAsaYVUpem71158_49" [label="decoder_2x4"];
  "n_KXh9xaAsaYVUpem71158_51" [label="bcd"];
  "n_KXh9xaAsaYVUpem71158_53" [label="o_tick"];
  "n_KXh9xaAsaYVUpem71158_56" [label="o_tick_counter"];
  "n_KXh9xaAsaYVUpem71158_57" [label="clk, rst"];
  "n_KXh9xaAsaYVUpem71158_58" [label="node_158-58"];
  "n_KXh9xaAsaYVUpem71158_6" [label="clk"];
  "n_KXh9xaAsaYVUpem71158_61" [label="mode"];
  "n_KXh9xaAsaYVUpem71158_63" [label="node_158-63"];
  "n_KXh9xaAsaYVUpem71158_64" [label="clear"];
  "n_KXh9xaAsaYVUpem71158_65" [label="run_stop"];
  "n_KXh9xaAsaYVUpem71158_73" [label="button_debounce"];
  "n_KXh9xaAsaYVUpem71158_74" [label="node_158-74"];
  "n_KXh9xaAsaYVUpem71158_79" [label="Btn_D"];
  "n_KXh9xaAsaYVUpem71158_8" [label="rst"];
  "n_KXh9xaAsaYVUpem71158_86" [label="Btn_L"];
  "n_KXh9xaAsaYVUpem71158_88" [label="Btn_R"];
  "n_KXh9xaAsaYVUpem71158_4" -> "n_KXh9xaAsaYVUpem71158_22";
  "n_KXh9xaAsaYVUpem71158_6" -> "n_KXh9xaAsaYVUpem71158_18";
  "n_KXh9xaAsaYVUpem71158_8" -> "n_KXh9xaAsaYVUpem71158_19";
  "n_KXh9xaAsaYVUpem71158_11" -> "n_KXh9xaAsaYVUpem71158_22";
  "n_KXh9xaAsaYVUpem71158_38" -> "n_KXh9xaAsaYVUpem71158_41";
  "n_KXh9xaAsaYVUpem71158_40" -> "n_KXh9xaAsaYVUpem71158_47";
  "n_KXh9xaAsaYVUpem71158_45" -> "n_KXh9xaAsaYVUpem71158_47";
  "n_KXh9xaAsaYVUpem71158_45" -> "n_KXh9xaAsaYVUpem71158_49";
  "n_KXh9xaAsaYVUpem71158_47" -> "n_KXh9xaAsaYVUpem71158_51";
  "n_KXh9xaAsaYVUpem71158_49" -> "n_KXh9xaAsaYVUpem71158_33";
  "n_KXh9xaAsaYVUpem71158_51" -> "n_KXh9xaAsaYVUpem71158_34";
  "n_KXh9xaAsaYVUpem71158_36" -> "n_KXh9xaAsaYVUpem71158_38";
  "n_KXh9xaAsaYVUpem71158_38" -> "n_KXh9xaAsaYVUpem71158_40";
  "n_KXh9xaAsaYVUpem71158_65" -> "n_KXh9xaAsaYVUpem71158_11";
  "n_JfB_RceYVCo8XynwxTDX_16" -> "n_JfB_RceYVCo8XynwxTDX_36";
  "n_JfB_RceYVCo8XynwxTDX_16" -> "n_JfB_RceYVCo8XynwxTDX_34";
  "n_JfB_RceYVCo8XynwxTDX_18" -> "n_JfB_RceYVCo8XynwxTDX_16";
  "n_JfB_RceYVCo8XynwxTDX_23" -> "n_JfB_RceYVCo8XynwxTDX_16";
  "n_JfB_RceYVCo8XynwxTDX_34" -> "n_JfB_RceYVCo8XynwxTDX_16";
  "n_JfB_RceYVCo8XynwxTDX_36" -> "n_JfB_RceYVCo8XynwxTDX_16";
}
